experiments/results/logs/ramp-hybrid-004/wrk2.txt
Running 5m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 7215.923ms, rate sampling interval: 14852ms
  Thread calibration: mean lat.: 7185.121ms, rate sampling interval: 14622ms
  Thread calibration: mean lat.: 7162.347ms, rate sampling interval: 14696ms
  Thread calibration: mean lat.: 7129.907ms, rate sampling interval: 14467ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.26s    11.06s   37.72s    78.16%
    Req/Sec    24.19     27.07    85.00     77.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.49s 
 75.000%   19.66s 
 90.000%   27.28s 
 99.000%   35.45s 
 99.900%   37.52s 
 99.990%   37.65s 
 99.999%   37.75s 
100.000%   37.75s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.442     0.000000            1         1.00
       1.463     0.100000         2859         1.11
       1.805     0.200000         5718         1.25
       2.177     0.300000         8571         1.43
     755.199     0.400000        11424         1.67
    6488.063     0.500000        14278         2.00
    9330.687     0.550000        15706         2.22
   12140.543     0.600000        17135         2.50
   14295.039     0.650000        18565         2.86
   16891.903     0.700000        19991         3.33
   19660.799     0.750000        21427         4.00
   20889.599     0.775000        22139         4.44
   22216.703     0.800000        22846         5.00
   23576.575     0.825000        23568         5.71
   24657.919     0.850000        24286         6.67
   25755.647     0.875000        24988         8.00
   26558.463     0.887500        25353         8.89
   27279.359     0.900000        25701        10.00
   27721.727     0.912500        26065        11.43
   28573.695     0.925000        26424        13.33
   29507.583     0.937500        26785        16.00
   29704.191     0.943750        26950        17.78
   30457.855     0.950000        27143        20.00
   30687.231     0.956250        27308        22.86
   31440.895     0.962500        27487        26.67
   31932.415     0.968750        27665        32.00
   32391.167     0.971875        27765        35.56
   32587.775     0.975000        27844        40.00
   33325.055     0.978125        27933        45.71
   33652.735     0.981250        28023        53.33
   34504.703     0.984375        28117        64.00
   34603.007     0.985938        28166        71.11
   34668.543     0.987500        28206        80.00
   34865.151     0.989062        28245        91.43
   35520.511     0.990625        28295       106.67
   35651.583     0.992188        28341       128.00
   35979.263     0.992969        28356       142.22
   36470.783     0.993750        28387       160.00
   36536.319     0.994531        28416       182.86
   36569.087     0.995313        28424       213.33
   36634.623     0.996094        28449       256.00
   36995.071     0.996484        28456       284.44
   37388.287     0.996875        28477       320.00
   37421.055     0.997266        28489       365.71
   37453.823     0.997656        28507       426.67
   37453.823     0.998047        28507       512.00
   37453.823     0.998242        28507       568.89
   37486.591     0.998437        28519       640.00
   37486.591     0.998633        28519       731.43
   37519.359     0.998828        28534       853.33
   37519.359     0.999023        28534      1024.00
   37519.359     0.999121        28534      1137.78
   37519.359     0.999219        28534      1280.00
   37552.127     0.999316        28542      1462.86
   37552.127     0.999414        28542      1706.67
   37584.895     0.999512        28546      2048.00
   37584.895     0.999561        28546      2275.56
   37584.895     0.999609        28546      2560.00
   37617.663     0.999658        28552      2925.71
   37617.663     0.999707        28552      3413.33
   37617.663     0.999756        28552      4096.00
   37617.663     0.999780        28552      4551.11
   37617.663     0.999805        28552      5120.00
   37617.663     0.999829        28552      5851.43
   37617.663     0.999854        28552      6826.67
   37650.431     0.999878        28554      8192.00
   37650.431     0.999890        28554      9102.22
   37650.431     0.999902        28554     10240.00
   37650.431     0.999915        28554     11702.86
   37650.431     0.999927        28554     13653.33
   37715.967     0.999939        28555     16384.00
   37715.967     0.999945        28555     18204.44
   37715.967     0.999951        28555     20480.00
   37715.967     0.999957        28555     23405.71
   37715.967     0.999963        28555     27306.67
   37748.735     0.999969        28556     32768.00
   37748.735     1.000000        28556          inf
#[Mean    =    10259.194, StdDeviation   =    11059.984]
#[Max     =    37715.968, Total count    =        28556]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  28660 requests in 5.00m, 152.75MB read
  Socket errors: connect 0, read 0, write 0, timeout 7537
  Non-2xx or 3xx responses: 27400
Requests/sec:     95.53
Transfer/sec:    521.38KB